{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_30", "layers": [{"name": "input_30", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_30"}, "inbound_nodes": []}, {"name": "conv2d_329", "class_name": "Conv2D", "config": {"name": "conv2d_329", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_30", 0, 0, {}]]]}, {"name": "leaky_re_lu_273", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_273", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_329", 0, 0, {}]]]}, {"name": "conv2d_330", "class_name": "Conv2D", "config": {"name": "conv2d_330", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_273", 0, 0, {}]]]}, {"name": "leaky_re_lu_274", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_274", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_330", 0, 0, {}]]]}, {"name": "conv2d_331", "class_name": "Conv2D", "config": {"name": "conv2d_331", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_274", 0, 0, {}]]]}, {"name": "leaky_re_lu_275", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_275", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_331", 0, 0, {}]]]}, {"name": "conv2d_332", "class_name": "Conv2D", "config": {"name": "conv2d_332", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_275", 0, 0, {}]]]}, {"name": "leaky_re_lu_276", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_276", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_332", 0, 0, {}]]]}, {"name": "conv2d_333", "class_name": "Conv2D", "config": {"name": "conv2d_333", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_276", 0, 0, {}]]]}, {"name": "leaky_re_lu_277", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_277", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_333", 0, 0, {}]]]}, {"name": "average_pooling2d_29", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_29", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_277", 0, 0, {}]]]}, {"name": "conv2d_334", "class_name": "Conv2D", "config": {"name": "conv2d_334", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_29", 0, 0, {}]]]}, {"name": "conv2d_335", "class_name": "Conv2D", "config": {"name": "conv2d_335", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_334", 0, 0, {}]]]}, {"name": "multiply_29", "class_name": "Multiply", "config": {"name": "multiply_29", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_277", 0, 0, {}], ["conv2d_335", 0, 0, {}]]]}, {"name": "conv2d_transpose_37", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_37", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_29", 0, 0, {}]]]}, {"name": "leaky_re_lu_278", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_278", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_37", 0, 0, {}]]]}, {"name": "cropping2d_54", "class_name": "Cropping2D", "config": {"name": "cropping2d_54", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_274", 0, 0, {}]]]}, {"name": "add_29", "class_name": "Add", "config": {"name": "add_29", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_278", 0, 0, {}], ["cropping2d_54", 0, 0, {}]]]}, {"name": "conv2d_336", "class_name": "Conv2D", "config": {"name": "conv2d_336", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_29", 0, 0, {}]]]}, {"name": "leaky_re_lu_279", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_279", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_336", 0, 0, {}]]]}, {"name": "conv2d_transpose_38", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_38", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_279", 0, 0, {}]]]}, {"name": "cropping2d_55", "class_name": "Cropping2D", "config": {"name": "cropping2d_55", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_38", 0, 0, {}]]]}, {"name": "conv2d_337", "class_name": "Conv2D", "config": {"name": "conv2d_337", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cropping2d_55", 0, 0, {}]]]}, {"name": "leaky_re_lu_280", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_280", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_337", 0, 0, {}]]]}, {"name": "conv2d_338", "class_name": "Conv2D", "config": {"name": "conv2d_338", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_280", 0, 0, {}]]]}, {"name": "leaky_re_lu_281", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_281", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_338", 0, 0, {}]]]}, {"name": "conv2d_339", "class_name": "Conv2D", "config": {"name": "conv2d_339", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_281", 0, 0, {}]]]}, {"name": "leaky_re_lu_282", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_282", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_339", 0, 0, {}]]]}, {"name": "conv2d_340", "class_name": "Conv2D", "config": {"name": "conv2d_340", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_282", 0, 0, {}]]]}, {"name": "leaky_re_lu_283", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_283", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_340", 0, 0, {}]]]}, {"name": "conv2d_341", "class_name": "Conv2D", "config": {"name": "conv2d_341", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_283", 0, 0, {}]]]}, {"name": "leaky_re_lu_284", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_284", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_341", 0, 0, {}]]]}, {"name": "average_pooling2d_30", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_30", "trainable": true, "dtype": "float32", "pool_size": [106, 106], "padding": "valid", "strides": [106, 106], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_284", 0, 0, {}]]]}, {"name": "conv2d_342", "class_name": "Conv2D", "config": {"name": "conv2d_342", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_30", 0, 0, {}]]]}, {"name": "conv2d_343", "class_name": "Conv2D", "config": {"name": "conv2d_343", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_342", 0, 0, {}]]]}, {"name": "multiply_30", "class_name": "Multiply", "config": {"name": "multiply_30", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_284", 0, 0, {}], ["conv2d_343", 0, 0, {}]]]}, {"name": "conv2d_344", "class_name": "Conv2D", "config": {"name": "conv2d_344", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_30", 0, 0, {}]]]}, {"name": "leaky_re_lu_285", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_285", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_344", 0, 0, {}]]]}, {"name": "conv2d_345", "class_name": "Conv2D", "config": {"name": "conv2d_345", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_285", 0, 0, {}]]]}, {"name": "leaky_re_lu_286", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_286", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_345", 0, 0, {}]]]}, {"name": "conv2d_346", "class_name": "Conv2D", "config": {"name": "conv2d_346", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_286", 0, 0, {}]]]}, {"name": "leaky_re_lu_287", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_287", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_346", 0, 0, {}]]]}, {"name": "average_pooling2d_31", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_31", "trainable": true, "dtype": "float32", "pool_size": [49, 49], "padding": "valid", "strides": [49, 49], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_287", 0, 0, {}]]]}, {"name": "conv2d_347", "class_name": "Conv2D", "config": {"name": "conv2d_347", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_31", 0, 0, {}]]]}, {"name": "conv2d_348", "class_name": "Conv2D", "config": {"name": "conv2d_348", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_347", 0, 0, {}]]]}, {"name": "multiply_31", "class_name": "Multiply", "config": {"name": "multiply_31", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_287", 0, 0, {}], ["conv2d_348", 0, 0, {}]]]}, {"name": "conv2d_transpose_39", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_39", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_31", 0, 0, {}]]]}, {"name": "leaky_re_lu_288", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_288", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_39", 0, 0, {}]]]}, {"name": "cropping2d_58", "class_name": "Cropping2D", "config": {"name": "cropping2d_58", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_30", 0, 0, {}]]]}, {"name": "add_30", "class_name": "Add", "config": {"name": "add_30", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_288", 0, 0, {}], ["cropping2d_58", 0, 0, {}]]]}, {"name": "conv2d_349", "class_name": "Conv2D", "config": {"name": "conv2d_349", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"name": "leaky_re_lu_289", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_289", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_349", 0, 0, {}]]]}, {"name": "conv2d_350", "class_name": "Conv2D", "config": {"name": "conv2d_350", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_289", 0, 0, {}]]]}, {"name": "leaky_re_lu_290", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_290", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_350", 0, 0, {}]]]}, {"name": "average_pooling2d_32", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_32", "trainable": true, "dtype": "float32", "pool_size": [94, 94], "padding": "valid", "strides": [94, 94], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_290", 0, 0, {}]]]}, {"name": "conv2d_351", "class_name": "Conv2D", "config": {"name": "conv2d_351", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_32", 0, 0, {}]]]}, {"name": "conv2d_352", "class_name": "Conv2D", "config": {"name": "conv2d_352", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_351", 0, 0, {}]]]}, {"name": "multiply_32", "class_name": "Multiply", "config": {"name": "multiply_32", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_290", 0, 0, {}], ["conv2d_352", 0, 0, {}]]]}, {"name": "conv2d_transpose_40", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_40", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_32", 0, 0, {}]]]}, {"name": "leaky_re_lu_291", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_291", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_40", 0, 0, {}]]]}, {"name": "cropping2d_57", "class_name": "Cropping2D", "config": {"name": "cropping2d_57", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_281", 0, 0, {}]]]}, {"name": "add_31", "class_name": "Add", "config": {"name": "add_31", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_291", 0, 0, {}], ["cropping2d_57", 0, 0, {}]]]}, {"name": "conv2d_353", "class_name": "Conv2D", "config": {"name": "conv2d_353", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_31", 0, 0, {}]]]}, {"name": "leaky_re_lu_292", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_292", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_353", 0, 0, {}]]]}, {"name": "conv2d_354", "class_name": "Conv2D", "config": {"name": "conv2d_354", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_292", 0, 0, {}]]]}, {"name": "cropping2d_56", "class_name": "Cropping2D", "config": {"name": "cropping2d_56", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["cropping2d_55", 0, 0, {}]]]}, {"name": "add_32", "class_name": "Add", "config": {"name": "add_32", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_354", 0, 0, {}], ["cropping2d_56", 0, 0, {}]]]}], "input_layers": [["input_30", 0, 0]], "output_layers": [["add_32", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_329/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_329/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_330/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_330/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_331/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_331/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_332/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_332/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_333/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_333/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_334/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_334/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_335/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_335/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_336/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_336/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_337/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_337/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_338/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_338/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_339/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_339/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_340/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_340/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_341/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_341/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_342/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_342/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_343/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_343/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_344/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_344/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_345/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_345/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_346/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_346/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_347/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_347/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_348/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_348/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_349/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_349/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_350/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_350/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_351/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_351/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_352/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_352/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_353/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_353/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_354/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_354/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_37/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_37/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_38/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_transpose_38/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_39/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_39/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_40/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_40/bias", "shape": [64], "dtype": "float32"}]}]}