{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_21", "layers": [{"name": "input_21", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_21"}, "inbound_nodes": []}, {"name": "conv2d_131", "class_name": "Conv2D", "config": {"name": "conv2d_131", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"name": "leaky_re_lu_121", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_121", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_131", 0, 0, {}]]]}, {"name": "conv2d_132", "class_name": "Conv2D", "config": {"name": "conv2d_132", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_121", 0, 0, {}]]]}, {"name": "leaky_re_lu_122", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_122", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_132", 0, 0, {}]]]}, {"name": "conv2d_133", "class_name": "Conv2D", "config": {"name": "conv2d_133", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_122", 0, 0, {}]]]}, {"name": "leaky_re_lu_123", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_123", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_133", 0, 0, {}]]]}, {"name": "conv2d_134", "class_name": "Conv2D", "config": {"name": "conv2d_134", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_123", 0, 0, {}]]]}, {"name": "leaky_re_lu_124", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_124", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_134", 0, 0, {}]]]}, {"name": "conv2d_135", "class_name": "Conv2D", "config": {"name": "conv2d_135", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_124", 0, 0, {}]]]}, {"name": "leaky_re_lu_125", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_125", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_135", 0, 0, {}]]]}, {"name": "conv2d_136", "class_name": "Conv2D", "config": {"name": "conv2d_136", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_125", 0, 0, {}]]]}, {"name": "leaky_re_lu_126", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_126", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_136", 0, 0, {}]]]}, {"name": "conv2d_transpose_11", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_11", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_126", 0, 0, {}]]]}, {"name": "cropping2d_21", "class_name": "Cropping2D", "config": {"name": "cropping2d_21", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_11", 0, 0, {}]]]}], "input_layers": [["input_21", 0, 0]], "output_layers": [["cropping2d_21", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_131/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_131/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_132/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_132/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_133/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_133/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_134/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_134/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_135/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_135/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_136/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_136/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_11/kernel", "shape": [4, 4, 3, 256], "dtype": "float32"}, {"name": "conv2d_transpose_11/bias", "shape": [3], "dtype": "float32"}]}]}