{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_31", "layers": [{"name": "input_31", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_31"}, "inbound_nodes": []}, {"name": "conv2d_355", "class_name": "Conv2D", "config": {"name": "conv2d_355", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_31", 0, 0, {}]]]}, {"name": "leaky_re_lu_293", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_293", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_355", 0, 0, {}]]]}, {"name": "conv2d_356", "class_name": "Conv2D", "config": {"name": "conv2d_356", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_293", 0, 0, {}]]]}, {"name": "leaky_re_lu_294", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_294", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_356", 0, 0, {}]]]}, {"name": "conv2d_357", "class_name": "Conv2D", "config": {"name": "conv2d_357", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_294", 0, 0, {}]]]}, {"name": "leaky_re_lu_295", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_295", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_357", 0, 0, {}]]]}, {"name": "conv2d_358", "class_name": "Conv2D", "config": {"name": "conv2d_358", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_295", 0, 0, {}]]]}, {"name": "leaky_re_lu_296", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_296", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_358", 0, 0, {}]]]}, {"name": "conv2d_359", "class_name": "Conv2D", "config": {"name": "conv2d_359", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_296", 0, 0, {}]]]}, {"name": "leaky_re_lu_297", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_297", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_359", 0, 0, {}]]]}, {"name": "average_pooling2d_33", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_33", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_297", 0, 0, {}]]]}, {"name": "conv2d_360", "class_name": "Conv2D", "config": {"name": "conv2d_360", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_33", 0, 0, {}]]]}, {"name": "conv2d_361", "class_name": "Conv2D", "config": {"name": "conv2d_361", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_360", 0, 0, {}]]]}, {"name": "multiply_33", "class_name": "Multiply", "config": {"name": "multiply_33", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_297", 0, 0, {}], ["conv2d_361", 0, 0, {}]]]}, {"name": "conv2d_transpose_41", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_41", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_33", 0, 0, {}]]]}, {"name": "leaky_re_lu_298", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_298", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_41", 0, 0, {}]]]}, {"name": "cropping2d_59", "class_name": "Cropping2D", "config": {"name": "cropping2d_59", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_294", 0, 0, {}]]]}, {"name": "add_33", "class_name": "Add", "config": {"name": "add_33", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_298", 0, 0, {}], ["cropping2d_59", 0, 0, {}]]]}, {"name": "conv2d_362", "class_name": "Conv2D", "config": {"name": "conv2d_362", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_33", 0, 0, {}]]]}, {"name": "leaky_re_lu_299", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_299", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_362", 0, 0, {}]]]}, {"name": "conv2d_transpose_42", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_42", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_299", 0, 0, {}]]]}, {"name": "cropping2d_60", "class_name": "Cropping2D", "config": {"name": "cropping2d_60", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_42", 0, 0, {}]]]}, {"name": "conv2d_363", "class_name": "Conv2D", "config": {"name": "conv2d_363", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cropping2d_60", 0, 0, {}]]]}, {"name": "leaky_re_lu_300", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_300", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_363", 0, 0, {}]]]}, {"name": "conv2d_364", "class_name": "Conv2D", "config": {"name": "conv2d_364", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_300", 0, 0, {}]]]}, {"name": "leaky_re_lu_301", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_301", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_364", 0, 0, {}]]]}, {"name": "conv2d_365", "class_name": "Conv2D", "config": {"name": "conv2d_365", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_301", 0, 0, {}]]]}, {"name": "leaky_re_lu_302", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_302", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_365", 0, 0, {}]]]}, {"name": "conv2d_366", "class_name": "Conv2D", "config": {"name": "conv2d_366", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_302", 0, 0, {}]]]}, {"name": "leaky_re_lu_303", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_303", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_366", 0, 0, {}]]]}, {"name": "conv2d_367", "class_name": "Conv2D", "config": {"name": "conv2d_367", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_303", 0, 0, {}]]]}, {"name": "leaky_re_lu_304", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_304", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_367", 0, 0, {}]]]}, {"name": "average_pooling2d_34", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_34", "trainable": true, "dtype": "float32", "pool_size": [106, 106], "padding": "valid", "strides": [106, 106], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_304", 0, 0, {}]]]}, {"name": "conv2d_368", "class_name": "Conv2D", "config": {"name": "conv2d_368", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_34", 0, 0, {}]]]}, {"name": "conv2d_369", "class_name": "Conv2D", "config": {"name": "conv2d_369", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_368", 0, 0, {}]]]}, {"name": "multiply_34", "class_name": "Multiply", "config": {"name": "multiply_34", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_304", 0, 0, {}], ["conv2d_369", 0, 0, {}]]]}, {"name": "conv2d_370", "class_name": "Conv2D", "config": {"name": "conv2d_370", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_34", 0, 0, {}]]]}, {"name": "leaky_re_lu_305", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_305", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_370", 0, 0, {}]]]}, {"name": "conv2d_371", "class_name": "Conv2D", "config": {"name": "conv2d_371", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_305", 0, 0, {}]]]}, {"name": "leaky_re_lu_306", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_306", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_371", 0, 0, {}]]]}, {"name": "conv2d_372", "class_name": "Conv2D", "config": {"name": "conv2d_372", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_306", 0, 0, {}]]]}, {"name": "leaky_re_lu_307", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_307", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_372", 0, 0, {}]]]}, {"name": "average_pooling2d_35", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_35", "trainable": true, "dtype": "float32", "pool_size": [49, 49], "padding": "valid", "strides": [49, 49], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_307", 0, 0, {}]]]}, {"name": "conv2d_373", "class_name": "Conv2D", "config": {"name": "conv2d_373", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_35", 0, 0, {}]]]}, {"name": "conv2d_374", "class_name": "Conv2D", "config": {"name": "conv2d_374", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_373", 0, 0, {}]]]}, {"name": "multiply_35", "class_name": "Multiply", "config": {"name": "multiply_35", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_307", 0, 0, {}], ["conv2d_374", 0, 0, {}]]]}, {"name": "conv2d_transpose_43", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_43", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_35", 0, 0, {}]]]}, {"name": "leaky_re_lu_308", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_308", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_43", 0, 0, {}]]]}, {"name": "cropping2d_63", "class_name": "Cropping2D", "config": {"name": "cropping2d_63", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_34", 0, 0, {}]]]}, {"name": "add_34", "class_name": "Add", "config": {"name": "add_34", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_308", 0, 0, {}], ["cropping2d_63", 0, 0, {}]]]}, {"name": "conv2d_375", "class_name": "Conv2D", "config": {"name": "conv2d_375", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_34", 0, 0, {}]]]}, {"name": "leaky_re_lu_309", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_309", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_375", 0, 0, {}]]]}, {"name": "conv2d_376", "class_name": "Conv2D", "config": {"name": "conv2d_376", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_309", 0, 0, {}]]]}, {"name": "leaky_re_lu_310", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_310", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_376", 0, 0, {}]]]}, {"name": "average_pooling2d_36", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_36", "trainable": true, "dtype": "float32", "pool_size": [94, 94], "padding": "valid", "strides": [94, 94], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_310", 0, 0, {}]]]}, {"name": "conv2d_377", "class_name": "Conv2D", "config": {"name": "conv2d_377", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_36", 0, 0, {}]]]}, {"name": "conv2d_378", "class_name": "Conv2D", "config": {"name": "conv2d_378", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_377", 0, 0, {}]]]}, {"name": "multiply_36", "class_name": "Multiply", "config": {"name": "multiply_36", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_310", 0, 0, {}], ["conv2d_378", 0, 0, {}]]]}, {"name": "conv2d_transpose_44", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_44", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_36", 0, 0, {}]]]}, {"name": "leaky_re_lu_311", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_311", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_44", 0, 0, {}]]]}, {"name": "cropping2d_62", "class_name": "Cropping2D", "config": {"name": "cropping2d_62", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_301", 0, 0, {}]]]}, {"name": "add_35", "class_name": "Add", "config": {"name": "add_35", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_311", 0, 0, {}], ["cropping2d_62", 0, 0, {}]]]}, {"name": "conv2d_379", "class_name": "Conv2D", "config": {"name": "conv2d_379", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_35", 0, 0, {}]]]}, {"name": "leaky_re_lu_312", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_312", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_379", 0, 0, {}]]]}, {"name": "conv2d_380", "class_name": "Conv2D", "config": {"name": "conv2d_380", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_312", 0, 0, {}]]]}, {"name": "cropping2d_61", "class_name": "Cropping2D", "config": {"name": "cropping2d_61", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["cropping2d_60", 0, 0, {}]]]}, {"name": "add_36", "class_name": "Add", "config": {"name": "add_36", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_380", 0, 0, {}], ["cropping2d_61", 0, 0, {}]]]}], "input_layers": [["input_31", 0, 0]], "output_layers": [["add_36", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_355/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_355/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_356/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_356/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_357/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_357/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_358/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_358/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_359/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_359/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_360/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_360/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_361/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_361/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_362/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_362/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_363/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_363/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_364/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_364/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_365/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_365/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_366/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_366/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_367/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_367/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_368/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_368/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_369/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_369/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_370/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_370/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_371/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_371/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_372/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_372/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_373/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_373/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_374/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_374/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_375/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_375/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_376/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_376/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_377/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_377/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_378/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_378/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_379/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_379/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_380/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_380/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_41/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_41/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_42/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_transpose_42/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_43/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_43/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_44/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_44/bias", "shape": [64], "dtype": "float32"}]}]}