{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_24", "layers": [{"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "conv2d_170", "class_name": "Conv2D", "config": {"name": "conv2d_170", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"name": "leaky_re_lu_153", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_153", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_170", 0, 0, {}]]]}, {"name": "conv2d_171", "class_name": "Conv2D", "config": {"name": "conv2d_171", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_153", 0, 0, {}]]]}, {"name": "leaky_re_lu_154", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_154", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_171", 0, 0, {}]]]}, {"name": "conv2d_172", "class_name": "Conv2D", "config": {"name": "conv2d_172", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_154", 0, 0, {}]]]}, {"name": "leaky_re_lu_155", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_155", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_172", 0, 0, {}]]]}, {"name": "conv2d_173", "class_name": "Conv2D", "config": {"name": "conv2d_173", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_155", 0, 0, {}]]]}, {"name": "leaky_re_lu_156", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_156", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_173", 0, 0, {}]]]}, {"name": "conv2d_174", "class_name": "Conv2D", "config": {"name": "conv2d_174", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_156", 0, 0, {}]]]}, {"name": "leaky_re_lu_157", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_157", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_174", 0, 0, {}]]]}, {"name": "average_pooling2d_5", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_157", 0, 0, {}]]]}, {"name": "conv2d_175", "class_name": "Conv2D", "config": {"name": "conv2d_175", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]]}, {"name": "conv2d_176", "class_name": "Conv2D", "config": {"name": "conv2d_176", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_175", 0, 0, {}]]]}, {"name": "multiply_5", "class_name": "Multiply", "config": {"name": "multiply_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_157", 0, 0, {}], ["conv2d_176", 0, 0, {}]]]}, {"name": "conv2d_transpose_16", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_16", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_158", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_158", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_16", 0, 0, {}]]]}, {"name": "cropping2d_27", "class_name": "Cropping2D", "config": {"name": "cropping2d_27", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_154", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_158", 0, 0, {}], ["cropping2d_27", 0, 0, {}]]]}, {"name": "conv2d_177", "class_name": "Conv2D", "config": {"name": "conv2d_177", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_159", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_159", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_177", 0, 0, {}]]]}, {"name": "conv2d_transpose_17", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_17", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_159", 0, 0, {}]]]}, {"name": "cropping2d_28", "class_name": "Cropping2D", "config": {"name": "cropping2d_28", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_17", 0, 0, {}]]]}, {"name": "conv2d_178", "class_name": "Conv2D", "config": {"name": "conv2d_178", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cropping2d_28", 0, 0, {}]]]}, {"name": "leaky_re_lu_160", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_160", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_178", 0, 0, {}]]]}, {"name": "conv2d_179", "class_name": "Conv2D", "config": {"name": "conv2d_179", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_160", 0, 0, {}]]]}, {"name": "leaky_re_lu_161", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_161", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_179", 0, 0, {}]]]}, {"name": "conv2d_180", "class_name": "Conv2D", "config": {"name": "conv2d_180", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_161", 0, 0, {}]]]}, {"name": "leaky_re_lu_162", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_162", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_180", 0, 0, {}]]]}, {"name": "conv2d_181", "class_name": "Conv2D", "config": {"name": "conv2d_181", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_162", 0, 0, {}]]]}, {"name": "leaky_re_lu_163", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_163", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_181", 0, 0, {}]]]}, {"name": "conv2d_182", "class_name": "Conv2D", "config": {"name": "conv2d_182", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_163", 0, 0, {}]]]}, {"name": "leaky_re_lu_164", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_164", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_182", 0, 0, {}]]]}, {"name": "average_pooling2d_6", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [106, 106], "padding": "valid", "strides": [106, 106], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_164", 0, 0, {}]]]}, {"name": "conv2d_183", "class_name": "Conv2D", "config": {"name": "conv2d_183", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_6", 0, 0, {}]]]}, {"name": "conv2d_184", "class_name": "Conv2D", "config": {"name": "conv2d_184", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_183", 0, 0, {}]]]}, {"name": "multiply_6", "class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_164", 0, 0, {}], ["conv2d_184", 0, 0, {}]]]}, {"name": "conv2d_185", "class_name": "Conv2D", "config": {"name": "conv2d_185", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_165", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_165", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_185", 0, 0, {}]]]}, {"name": "conv2d_186", "class_name": "Conv2D", "config": {"name": "conv2d_186", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_165", 0, 0, {}]]]}, {"name": "leaky_re_lu_166", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_166", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_186", 0, 0, {}]]]}, {"name": "conv2d_187", "class_name": "Conv2D", "config": {"name": "conv2d_187", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_166", 0, 0, {}]]]}, {"name": "leaky_re_lu_167", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_167", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_187", 0, 0, {}]]]}, {"name": "average_pooling2d_7", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_7", "trainable": true, "dtype": "float32", "pool_size": [49, 49], "padding": "valid", "strides": [49, 49], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_167", 0, 0, {}]]]}, {"name": "conv2d_188", "class_name": "Conv2D", "config": {"name": "conv2d_188", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_7", 0, 0, {}]]]}, {"name": "conv2d_189", "class_name": "Conv2D", "config": {"name": "conv2d_189", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_188", 0, 0, {}]]]}, {"name": "multiply_7", "class_name": "Multiply", "config": {"name": "multiply_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_167", 0, 0, {}], ["conv2d_189", 0, 0, {}]]]}, {"name": "conv2d_transpose_18", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_18", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_168", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_168", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_18", 0, 0, {}]]]}, {"name": "cropping2d_31", "class_name": "Cropping2D", "config": {"name": "cropping2d_31", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_168", 0, 0, {}], ["cropping2d_31", 0, 0, {}]]]}, {"name": "conv2d_190", "class_name": "Conv2D", "config": {"name": "conv2d_190", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_169", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_169", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_190", 0, 0, {}]]]}, {"name": "conv2d_191", "class_name": "Conv2D", "config": {"name": "conv2d_191", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_169", 0, 0, {}]]]}, {"name": "leaky_re_lu_170", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_170", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_191", 0, 0, {}]]]}, {"name": "average_pooling2d_8", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_8", "trainable": true, "dtype": "float32", "pool_size": [94, 94], "padding": "valid", "strides": [94, 94], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_170", 0, 0, {}]]]}, {"name": "conv2d_192", "class_name": "Conv2D", "config": {"name": "conv2d_192", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_8", 0, 0, {}]]]}, {"name": "conv2d_193", "class_name": "Conv2D", "config": {"name": "conv2d_193", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_192", 0, 0, {}]]]}, {"name": "multiply_8", "class_name": "Multiply", "config": {"name": "multiply_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_170", 0, 0, {}], ["conv2d_193", 0, 0, {}]]]}, {"name": "conv2d_transpose_19", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_19", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_171", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_171", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_19", 0, 0, {}]]]}, {"name": "cropping2d_30", "class_name": "Cropping2D", "config": {"name": "cropping2d_30", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_161", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_171", 0, 0, {}], ["cropping2d_30", 0, 0, {}]]]}, {"name": "conv2d_194", "class_name": "Conv2D", "config": {"name": "conv2d_194", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_172", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_172", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_194", 0, 0, {}]]]}, {"name": "conv2d_195", "class_name": "Conv2D", "config": {"name": "conv2d_195", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_172", 0, 0, {}]]]}, {"name": "cropping2d_29", "class_name": "Cropping2D", "config": {"name": "cropping2d_29", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["cropping2d_28", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_195", 0, 0, {}], ["cropping2d_29", 0, 0, {}]]]}], "input_layers": [["input_24", 0, 0]], "output_layers": [["add_8", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_170/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_170/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_171/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_171/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_172/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_172/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_173/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_173/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_174/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_174/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_175/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_175/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_176/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_176/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_177/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_177/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_178/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_178/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_179/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_179/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_180/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_180/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_181/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_181/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_182/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_182/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_183/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_183/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_184/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_184/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_185/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_185/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_186/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_186/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_187/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_187/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_188/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_188/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_189/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_189/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_190/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_190/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_191/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_191/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_192/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_192/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_193/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_193/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_194/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_194/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_195/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_195/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_16/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_16/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_17/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_transpose_17/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_18/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_18/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_19/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_19/bias", "shape": [64], "dtype": "float32"}]}]}