{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_27", "layers": [{"name": "input_27", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_27"}, "inbound_nodes": []}, {"name": "conv2d_249", "class_name": "Conv2D", "config": {"name": "conv2d_249", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_27", 0, 0, {}]]]}, {"name": "leaky_re_lu_213", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_213", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_249", 0, 0, {}]]]}, {"name": "conv2d_250", "class_name": "Conv2D", "config": {"name": "conv2d_250", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_213", 0, 0, {}]]]}, {"name": "leaky_re_lu_214", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_214", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_250", 0, 0, {}]]]}, {"name": "conv2d_251", "class_name": "Conv2D", "config": {"name": "conv2d_251", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_214", 0, 0, {}]]]}, {"name": "leaky_re_lu_215", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_215", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_251", 0, 0, {}]]]}, {"name": "conv2d_252", "class_name": "Conv2D", "config": {"name": "conv2d_252", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_215", 0, 0, {}]]]}, {"name": "leaky_re_lu_216", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_216", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_252", 0, 0, {}]]]}, {"name": "conv2d_253", "class_name": "Conv2D", "config": {"name": "conv2d_253", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_216", 0, 0, {}]]]}, {"name": "leaky_re_lu_217", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_217", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_253", 0, 0, {}]]]}, {"name": "average_pooling2d_17", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_17", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_217", 0, 0, {}]]]}, {"name": "conv2d_254", "class_name": "Conv2D", "config": {"name": "conv2d_254", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_17", 0, 0, {}]]]}, {"name": "conv2d_255", "class_name": "Conv2D", "config": {"name": "conv2d_255", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_254", 0, 0, {}]]]}, {"name": "multiply_17", "class_name": "Multiply", "config": {"name": "multiply_17", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_217", 0, 0, {}], ["conv2d_255", 0, 0, {}]]]}, {"name": "conv2d_transpose_27", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_27", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_17", 0, 0, {}]]]}, {"name": "leaky_re_lu_218", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_218", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_27", 0, 0, {}]]]}, {"name": "cropping2d_41", "class_name": "Cropping2D", "config": {"name": "cropping2d_41", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_214", 0, 0, {}]]]}, {"name": "add_17", "class_name": "Add", "config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_218", 0, 0, {}], ["cropping2d_41", 0, 0, {}]]]}, {"name": "conv2d_256", "class_name": "Conv2D", "config": {"name": "conv2d_256", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"name": "leaky_re_lu_219", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_219", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_256", 0, 0, {}]]]}, {"name": "conv2d_257", "class_name": "Conv2D", "config": {"name": "conv2d_257", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_219", 0, 0, {}]]]}, {"name": "conv2d_258", "class_name": "Conv2D", "config": {"name": "conv2d_258", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_257", 0, 0, {}]]]}, {"name": "leaky_re_lu_220", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_220", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_258", 0, 0, {}]]]}, {"name": "conv2d_259", "class_name": "Conv2D", "config": {"name": "conv2d_259", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_220", 0, 0, {}]]]}, {"name": "leaky_re_lu_221", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_221", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_259", 0, 0, {}]]]}, {"name": "conv2d_260", "class_name": "Conv2D", "config": {"name": "conv2d_260", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_221", 0, 0, {}]]]}, {"name": "leaky_re_lu_222", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_222", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_260", 0, 0, {}]]]}, {"name": "conv2d_261", "class_name": "Conv2D", "config": {"name": "conv2d_261", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_222", 0, 0, {}]]]}, {"name": "leaky_re_lu_223", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_223", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_261", 0, 0, {}]]]}, {"name": "conv2d_262", "class_name": "Conv2D", "config": {"name": "conv2d_262", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_223", 0, 0, {}]]]}, {"name": "leaky_re_lu_224", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_224", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_262", 0, 0, {}]]]}, {"name": "average_pooling2d_18", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_18", "trainable": true, "dtype": "float32", "pool_size": [50, 50], "padding": "valid", "strides": [50, 50], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_224", 0, 0, {}]]]}, {"name": "conv2d_263", "class_name": "Conv2D", "config": {"name": "conv2d_263", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_18", 0, 0, {}]]]}, {"name": "conv2d_264", "class_name": "Conv2D", "config": {"name": "conv2d_264", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_263", 0, 0, {}]]]}, {"name": "multiply_18", "class_name": "Multiply", "config": {"name": "multiply_18", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_224", 0, 0, {}], ["conv2d_264", 0, 0, {}]]]}, {"name": "conv2d_265", "class_name": "Conv2D", "config": {"name": "conv2d_265", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_18", 0, 0, {}]]]}, {"name": "leaky_re_lu_225", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_225", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_265", 0, 0, {}]]]}, {"name": "conv2d_266", "class_name": "Conv2D", "config": {"name": "conv2d_266", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_225", 0, 0, {}]]]}, {"name": "leaky_re_lu_226", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_226", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_266", 0, 0, {}]]]}, {"name": "conv2d_267", "class_name": "Conv2D", "config": {"name": "conv2d_267", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_226", 0, 0, {}]]]}, {"name": "leaky_re_lu_227", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_227", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_267", 0, 0, {}]]]}, {"name": "average_pooling2d_19", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_19", "trainable": true, "dtype": "float32", "pool_size": [21, 21], "padding": "valid", "strides": [21, 21], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_227", 0, 0, {}]]]}, {"name": "conv2d_268", "class_name": "Conv2D", "config": {"name": "conv2d_268", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_19", 0, 0, {}]]]}, {"name": "conv2d_269", "class_name": "Conv2D", "config": {"name": "conv2d_269", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_268", 0, 0, {}]]]}, {"name": "multiply_19", "class_name": "Multiply", "config": {"name": "multiply_19", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_227", 0, 0, {}], ["conv2d_269", 0, 0, {}]]]}, {"name": "conv2d_transpose_28", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_28", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_19", 0, 0, {}]]]}, {"name": "leaky_re_lu_228", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_228", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_28", 0, 0, {}]]]}, {"name": "cropping2d_44", "class_name": "Cropping2D", "config": {"name": "cropping2d_44", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_18", 0, 0, {}]]]}, {"name": "add_18", "class_name": "Add", "config": {"name": "add_18", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_228", 0, 0, {}], ["cropping2d_44", 0, 0, {}]]]}, {"name": "conv2d_270", "class_name": "Conv2D", "config": {"name": "conv2d_270", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"name": "leaky_re_lu_229", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_229", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_270", 0, 0, {}]]]}, {"name": "conv2d_271", "class_name": "Conv2D", "config": {"name": "conv2d_271", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_229", 0, 0, {}]]]}, {"name": "leaky_re_lu_230", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_230", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_271", 0, 0, {}]]]}, {"name": "average_pooling2d_20", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_20", "trainable": true, "dtype": "float32", "pool_size": [38, 38], "padding": "valid", "strides": [38, 38], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_230", 0, 0, {}]]]}, {"name": "conv2d_272", "class_name": "Conv2D", "config": {"name": "conv2d_272", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_20", 0, 0, {}]]]}, {"name": "conv2d_273", "class_name": "Conv2D", "config": {"name": "conv2d_273", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_272", 0, 0, {}]]]}, {"name": "multiply_20", "class_name": "Multiply", "config": {"name": "multiply_20", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_230", 0, 0, {}], ["conv2d_273", 0, 0, {}]]]}, {"name": "conv2d_transpose_29", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_29", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_20", 0, 0, {}]]]}, {"name": "leaky_re_lu_231", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_231", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_29", 0, 0, {}]]]}, {"name": "cropping2d_43", "class_name": "Cropping2D", "config": {"name": "cropping2d_43", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_221", 0, 0, {}]]]}, {"name": "add_19", "class_name": "Add", "config": {"name": "add_19", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_231", 0, 0, {}], ["cropping2d_43", 0, 0, {}]]]}, {"name": "conv2d_274", "class_name": "Conv2D", "config": {"name": "conv2d_274", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"name": "leaky_re_lu_232", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_232", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_274", 0, 0, {}]]]}, {"name": "conv2d_275", "class_name": "Conv2D", "config": {"name": "conv2d_275", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_232", 0, 0, {}]]]}, {"name": "cropping2d_42", "class_name": "Cropping2D", "config": {"name": "cropping2d_42", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_257", 0, 0, {}]]]}, {"name": "add_20", "class_name": "Add", "config": {"name": "add_20", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_275", 0, 0, {}], ["cropping2d_42", 0, 0, {}]]]}], "input_layers": [["input_27", 0, 0]], "output_layers": [["add_20", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_249/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_249/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_250/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_250/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_251/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_251/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_252/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_252/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_253/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_253/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_254/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_254/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_255/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_255/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_256/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_256/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_257/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_257/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_258/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_258/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_259/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_259/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_260/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_260/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_261/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_261/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_262/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_262/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_263/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_263/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_264/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_264/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_265/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_265/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_266/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_266/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_267/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_267/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_268/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_268/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_269/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_269/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_270/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_270/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_271/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_271/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_272/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_272/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_273/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_273/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_274/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_274/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_275/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_275/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_27/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_27/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_28/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_28/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_29/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_29/bias", "shape": [64], "dtype": "float32"}]}]}