{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_20", "layers": [{"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_20"}, "inbound_nodes": []}, {"name": "conv2d_125", "class_name": "Conv2D", "config": {"name": "conv2d_125", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "leaky_re_lu_115", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_115", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_125", 0, 0, {}]]]}, {"name": "conv2d_126", "class_name": "Conv2D", "config": {"name": "conv2d_126", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_115", 0, 0, {}]]]}, {"name": "leaky_re_lu_116", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_116", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_126", 0, 0, {}]]]}, {"name": "conv2d_127", "class_name": "Conv2D", "config": {"name": "conv2d_127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_116", 0, 0, {}]]]}, {"name": "leaky_re_lu_117", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_117", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_127", 0, 0, {}]]]}, {"name": "conv2d_128", "class_name": "Conv2D", "config": {"name": "conv2d_128", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_117", 0, 0, {}]]]}, {"name": "leaky_re_lu_118", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_118", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_128", 0, 0, {}]]]}, {"name": "conv2d_129", "class_name": "Conv2D", "config": {"name": "conv2d_129", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_118", 0, 0, {}]]]}, {"name": "leaky_re_lu_119", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_119", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_129", 0, 0, {}]]]}, {"name": "conv2d_130", "class_name": "Conv2D", "config": {"name": "conv2d_130", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_119", 0, 0, {}]]]}, {"name": "leaky_re_lu_120", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_120", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_130", 0, 0, {}]]]}, {"name": "conv2d_transpose_10", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_10", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_120", 0, 0, {}]]]}, {"name": "cropping2d_20", "class_name": "Cropping2D", "config": {"name": "cropping2d_20", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_10", 0, 0, {}]]]}], "input_layers": [["input_20", 0, 0]], "output_layers": [["cropping2d_20", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_125/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_125/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_126/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_126/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_127/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_127/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_128/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_128/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_129/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_129/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_130/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_130/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_10/kernel", "shape": [4, 4, 3, 256], "dtype": "float32"}, {"name": "conv2d_transpose_10/bias", "shape": [3], "dtype": "float32"}]}]}