{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_25", "layers": [{"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "conv2d_196", "class_name": "Conv2D", "config": {"name": "conv2d_196", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "leaky_re_lu_173", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_173", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_196", 0, 0, {}]]]}, {"name": "conv2d_197", "class_name": "Conv2D", "config": {"name": "conv2d_197", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_173", 0, 0, {}]]]}, {"name": "leaky_re_lu_174", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_174", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_197", 0, 0, {}]]]}, {"name": "conv2d_198", "class_name": "Conv2D", "config": {"name": "conv2d_198", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_174", 0, 0, {}]]]}, {"name": "leaky_re_lu_175", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_175", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_198", 0, 0, {}]]]}, {"name": "conv2d_199", "class_name": "Conv2D", "config": {"name": "conv2d_199", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_175", 0, 0, {}]]]}, {"name": "leaky_re_lu_176", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_176", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_199", 0, 0, {}]]]}, {"name": "conv2d_200", "class_name": "Conv2D", "config": {"name": "conv2d_200", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_176", 0, 0, {}]]]}, {"name": "leaky_re_lu_177", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_177", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_200", 0, 0, {}]]]}, {"name": "average_pooling2d_9", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_177", 0, 0, {}]]]}, {"name": "conv2d_201", "class_name": "Conv2D", "config": {"name": "conv2d_201", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}]]]}, {"name": "conv2d_202", "class_name": "Conv2D", "config": {"name": "conv2d_202", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_201", 0, 0, {}]]]}, {"name": "multiply_9", "class_name": "Multiply", "config": {"name": "multiply_9", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_177", 0, 0, {}], ["conv2d_202", 0, 0, {}]]]}, {"name": "conv2d_transpose_20", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_20", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_178", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_178", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_20", 0, 0, {}]]]}, {"name": "cropping2d_32", "class_name": "Cropping2D", "config": {"name": "cropping2d_32", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_174", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_178", 0, 0, {}], ["cropping2d_32", 0, 0, {}]]]}, {"name": "conv2d_203", "class_name": "Conv2D", "config": {"name": "conv2d_203", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_179", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_179", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_203", 0, 0, {}]]]}, {"name": "conv2d_204", "class_name": "Conv2D", "config": {"name": "conv2d_204", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_179", 0, 0, {}]]]}, {"name": "conv2d_205", "class_name": "Conv2D", "config": {"name": "conv2d_205", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_204", 0, 0, {}]]]}, {"name": "leaky_re_lu_180", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_180", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_205", 0, 0, {}]]]}, {"name": "conv2d_206", "class_name": "Conv2D", "config": {"name": "conv2d_206", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_180", 0, 0, {}]]]}, {"name": "leaky_re_lu_181", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_181", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_206", 0, 0, {}]]]}, {"name": "conv2d_207", "class_name": "Conv2D", "config": {"name": "conv2d_207", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_181", 0, 0, {}]]]}, {"name": "leaky_re_lu_182", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_182", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_207", 0, 0, {}]]]}, {"name": "conv2d_208", "class_name": "Conv2D", "config": {"name": "conv2d_208", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_182", 0, 0, {}]]]}, {"name": "leaky_re_lu_183", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_183", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_208", 0, 0, {}]]]}, {"name": "conv2d_209", "class_name": "Conv2D", "config": {"name": "conv2d_209", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_183", 0, 0, {}]]]}, {"name": "leaky_re_lu_184", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_184", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_209", 0, 0, {}]]]}, {"name": "average_pooling2d_10", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [50, 50], "padding": "valid", "strides": [50, 50], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_184", 0, 0, {}]]]}, {"name": "conv2d_210", "class_name": "Conv2D", "config": {"name": "conv2d_210", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_10", 0, 0, {}]]]}, {"name": "conv2d_211", "class_name": "Conv2D", "config": {"name": "conv2d_211", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_210", 0, 0, {}]]]}, {"name": "multiply_10", "class_name": "Multiply", "config": {"name": "multiply_10", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_184", 0, 0, {}], ["conv2d_211", 0, 0, {}]]]}, {"name": "conv2d_212", "class_name": "Conv2D", "config": {"name": "conv2d_212", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_185", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_185", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"name": "conv2d_213", "class_name": "Conv2D", "config": {"name": "conv2d_213", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_185", 0, 0, {}]]]}, {"name": "leaky_re_lu_186", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_186", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"name": "conv2d_214", "class_name": "Conv2D", "config": {"name": "conv2d_214", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_186", 0, 0, {}]]]}, {"name": "leaky_re_lu_187", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_187", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_214", 0, 0, {}]]]}, {"name": "average_pooling2d_11", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_11", "trainable": true, "dtype": "float32", "pool_size": [21, 21], "padding": "valid", "strides": [21, 21], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_187", 0, 0, {}]]]}, {"name": "conv2d_215", "class_name": "Conv2D", "config": {"name": "conv2d_215", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_11", 0, 0, {}]]]}, {"name": "conv2d_216", "class_name": "Conv2D", "config": {"name": "conv2d_216", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"name": "multiply_11", "class_name": "Multiply", "config": {"name": "multiply_11", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_187", 0, 0, {}], ["conv2d_216", 0, 0, {}]]]}, {"name": "conv2d_transpose_21", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_21", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_188", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_188", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_21", 0, 0, {}]]]}, {"name": "cropping2d_35", "class_name": "Cropping2D", "config": {"name": "cropping2d_35", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_10", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_188", 0, 0, {}], ["cropping2d_35", 0, 0, {}]]]}, {"name": "conv2d_217", "class_name": "Conv2D", "config": {"name": "conv2d_217", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_189", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_189", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_217", 0, 0, {}]]]}, {"name": "conv2d_218", "class_name": "Conv2D", "config": {"name": "conv2d_218", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_189", 0, 0, {}]]]}, {"name": "leaky_re_lu_190", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_190", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_218", 0, 0, {}]]]}, {"name": "average_pooling2d_12", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [38, 38], "padding": "valid", "strides": [38, 38], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_190", 0, 0, {}]]]}, {"name": "conv2d_219", "class_name": "Conv2D", "config": {"name": "conv2d_219", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_12", 0, 0, {}]]]}, {"name": "conv2d_220", "class_name": "Conv2D", "config": {"name": "conv2d_220", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_219", 0, 0, {}]]]}, {"name": "multiply_12", "class_name": "Multiply", "config": {"name": "multiply_12", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_190", 0, 0, {}], ["conv2d_220", 0, 0, {}]]]}, {"name": "conv2d_transpose_22", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_22", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_12", 0, 0, {}]]]}, {"name": "leaky_re_lu_191", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_191", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_22", 0, 0, {}]]]}, {"name": "cropping2d_34", "class_name": "Cropping2D", "config": {"name": "cropping2d_34", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_181", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_191", 0, 0, {}], ["cropping2d_34", 0, 0, {}]]]}, {"name": "conv2d_221", "class_name": "Conv2D", "config": {"name": "conv2d_221", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_192", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_192", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_221", 0, 0, {}]]]}, {"name": "conv2d_222", "class_name": "Conv2D", "config": {"name": "conv2d_222", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_192", 0, 0, {}]]]}, {"name": "cropping2d_33", "class_name": "Cropping2D", "config": {"name": "cropping2d_33", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_204", 0, 0, {}]]]}, {"name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_222", 0, 0, {}], ["cropping2d_33", 0, 0, {}]]]}], "input_layers": [["input_25", 0, 0]], "output_layers": [["add_12", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_196/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_196/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_197/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_197/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_198/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_198/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_199/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_199/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_200/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_200/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_201/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_201/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_202/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_202/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_203/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_203/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_204/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_204/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_205/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_205/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_206/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_206/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_207/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_207/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_208/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_208/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_209/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_209/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_210/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_210/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_211/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_211/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_212/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_212/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_213/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_213/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_214/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_214/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_215/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_215/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_216/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_216/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_217/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_217/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_218/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_218/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_219/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_219/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_220/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_220/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_221/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_221/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_222/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_222/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_20/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_20/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_21/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_21/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_22/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_22/bias", "shape": [64], "dtype": "float32"}]}]}