{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_28", "layers": [{"name": "input_28", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_28"}, "inbound_nodes": []}, {"name": "conv2d_276", "class_name": "Conv2D", "config": {"name": "conv2d_276", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"name": "leaky_re_lu_233", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_233", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_276", 0, 0, {}]]]}, {"name": "conv2d_277", "class_name": "Conv2D", "config": {"name": "conv2d_277", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_233", 0, 0, {}]]]}, {"name": "leaky_re_lu_234", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_234", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_277", 0, 0, {}]]]}, {"name": "conv2d_278", "class_name": "Conv2D", "config": {"name": "conv2d_278", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_234", 0, 0, {}]]]}, {"name": "leaky_re_lu_235", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_235", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_278", 0, 0, {}]]]}, {"name": "conv2d_279", "class_name": "Conv2D", "config": {"name": "conv2d_279", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_235", 0, 0, {}]]]}, {"name": "leaky_re_lu_236", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_236", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_279", 0, 0, {}]]]}, {"name": "conv2d_280", "class_name": "Conv2D", "config": {"name": "conv2d_280", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_236", 0, 0, {}]]]}, {"name": "leaky_re_lu_237", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_237", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_280", 0, 0, {}]]]}, {"name": "average_pooling2d_21", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_21", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_237", 0, 0, {}]]]}, {"name": "conv2d_281", "class_name": "Conv2D", "config": {"name": "conv2d_281", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_21", 0, 0, {}]]]}, {"name": "conv2d_282", "class_name": "Conv2D", "config": {"name": "conv2d_282", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_281", 0, 0, {}]]]}, {"name": "multiply_21", "class_name": "Multiply", "config": {"name": "multiply_21", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_237", 0, 0, {}], ["conv2d_282", 0, 0, {}]]]}, {"name": "conv2d_transpose_30", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_30", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_21", 0, 0, {}]]]}, {"name": "leaky_re_lu_238", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_238", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_30", 0, 0, {}]]]}, {"name": "cropping2d_45", "class_name": "Cropping2D", "config": {"name": "cropping2d_45", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_234", 0, 0, {}]]]}, {"name": "add_21", "class_name": "Add", "config": {"name": "add_21", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_238", 0, 0, {}], ["cropping2d_45", 0, 0, {}]]]}, {"name": "conv2d_283", "class_name": "Conv2D", "config": {"name": "conv2d_283", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"name": "leaky_re_lu_239", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_239", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_283", 0, 0, {}]]]}, {"name": "conv2d_transpose_31", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_31", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_239", 0, 0, {}]]]}, {"name": "cropping2d_46", "class_name": "Cropping2D", "config": {"name": "cropping2d_46", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_31", 0, 0, {}]]]}, {"name": "conv2d_284", "class_name": "Conv2D", "config": {"name": "conv2d_284", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["cropping2d_46", 0, 0, {}]]]}, {"name": "leaky_re_lu_240", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_240", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_284", 0, 0, {}]]]}, {"name": "conv2d_285", "class_name": "Conv2D", "config": {"name": "conv2d_285", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_240", 0, 0, {}]]]}, {"name": "leaky_re_lu_241", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_241", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_285", 0, 0, {}]]]}, {"name": "conv2d_286", "class_name": "Conv2D", "config": {"name": "conv2d_286", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_241", 0, 0, {}]]]}, {"name": "leaky_re_lu_242", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_242", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_286", 0, 0, {}]]]}, {"name": "conv2d_287", "class_name": "Conv2D", "config": {"name": "conv2d_287", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_242", 0, 0, {}]]]}, {"name": "leaky_re_lu_243", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_243", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_287", 0, 0, {}]]]}, {"name": "conv2d_288", "class_name": "Conv2D", "config": {"name": "conv2d_288", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_243", 0, 0, {}]]]}, {"name": "leaky_re_lu_244", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_244", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_288", 0, 0, {}]]]}, {"name": "average_pooling2d_22", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_22", "trainable": true, "dtype": "float32", "pool_size": [106, 106], "padding": "valid", "strides": [106, 106], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_244", 0, 0, {}]]]}, {"name": "conv2d_289", "class_name": "Conv2D", "config": {"name": "conv2d_289", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_22", 0, 0, {}]]]}, {"name": "conv2d_290", "class_name": "Conv2D", "config": {"name": "conv2d_290", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_289", 0, 0, {}]]]}, {"name": "multiply_22", "class_name": "Multiply", "config": {"name": "multiply_22", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_244", 0, 0, {}], ["conv2d_290", 0, 0, {}]]]}, {"name": "conv2d_291", "class_name": "Conv2D", "config": {"name": "conv2d_291", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_22", 0, 0, {}]]]}, {"name": "leaky_re_lu_245", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_245", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_291", 0, 0, {}]]]}, {"name": "conv2d_292", "class_name": "Conv2D", "config": {"name": "conv2d_292", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_245", 0, 0, {}]]]}, {"name": "leaky_re_lu_246", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_246", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_292", 0, 0, {}]]]}, {"name": "conv2d_293", "class_name": "Conv2D", "config": {"name": "conv2d_293", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_246", 0, 0, {}]]]}, {"name": "leaky_re_lu_247", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_247", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_293", 0, 0, {}]]]}, {"name": "average_pooling2d_23", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_23", "trainable": true, "dtype": "float32", "pool_size": [49, 49], "padding": "valid", "strides": [49, 49], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_247", 0, 0, {}]]]}, {"name": "conv2d_294", "class_name": "Conv2D", "config": {"name": "conv2d_294", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_23", 0, 0, {}]]]}, {"name": "conv2d_295", "class_name": "Conv2D", "config": {"name": "conv2d_295", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_294", 0, 0, {}]]]}, {"name": "multiply_23", "class_name": "Multiply", "config": {"name": "multiply_23", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_247", 0, 0, {}], ["conv2d_295", 0, 0, {}]]]}, {"name": "conv2d_transpose_32", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_32", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_23", 0, 0, {}]]]}, {"name": "leaky_re_lu_248", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_248", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_32", 0, 0, {}]]]}, {"name": "cropping2d_49", "class_name": "Cropping2D", "config": {"name": "cropping2d_49", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_22", 0, 0, {}]]]}, {"name": "add_22", "class_name": "Add", "config": {"name": "add_22", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_248", 0, 0, {}], ["cropping2d_49", 0, 0, {}]]]}, {"name": "conv2d_296", "class_name": "Conv2D", "config": {"name": "conv2d_296", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"name": "leaky_re_lu_249", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_249", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_296", 0, 0, {}]]]}, {"name": "conv2d_297", "class_name": "Conv2D", "config": {"name": "conv2d_297", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_249", 0, 0, {}]]]}, {"name": "leaky_re_lu_250", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_250", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_297", 0, 0, {}]]]}, {"name": "average_pooling2d_24", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_24", "trainable": true, "dtype": "float32", "pool_size": [94, 94], "padding": "valid", "strides": [94, 94], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_250", 0, 0, {}]]]}, {"name": "conv2d_298", "class_name": "Conv2D", "config": {"name": "conv2d_298", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_24", 0, 0, {}]]]}, {"name": "conv2d_299", "class_name": "Conv2D", "config": {"name": "conv2d_299", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_298", 0, 0, {}]]]}, {"name": "multiply_24", "class_name": "Multiply", "config": {"name": "multiply_24", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_250", 0, 0, {}], ["conv2d_299", 0, 0, {}]]]}, {"name": "conv2d_transpose_33", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_33", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_24", 0, 0, {}]]]}, {"name": "leaky_re_lu_251", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_251", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_33", 0, 0, {}]]]}, {"name": "cropping2d_48", "class_name": "Cropping2D", "config": {"name": "cropping2d_48", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_241", 0, 0, {}]]]}, {"name": "add_23", "class_name": "Add", "config": {"name": "add_23", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_251", 0, 0, {}], ["cropping2d_48", 0, 0, {}]]]}, {"name": "conv2d_300", "class_name": "Conv2D", "config": {"name": "conv2d_300", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_23", 0, 0, {}]]]}, {"name": "leaky_re_lu_252", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_252", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_300", 0, 0, {}]]]}, {"name": "conv2d_301", "class_name": "Conv2D", "config": {"name": "conv2d_301", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_252", 0, 0, {}]]]}, {"name": "cropping2d_47", "class_name": "Cropping2D", "config": {"name": "cropping2d_47", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["cropping2d_46", 0, 0, {}]]]}, {"name": "add_24", "class_name": "Add", "config": {"name": "add_24", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_301", 0, 0, {}], ["cropping2d_47", 0, 0, {}]]]}], "input_layers": [["input_28", 0, 0]], "output_layers": [["add_24", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_276/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_276/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_277/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_277/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_278/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_278/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_279/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_279/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_280/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_280/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_281/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_281/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_282/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_282/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_283/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_283/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_284/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_284/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_285/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_285/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_286/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_286/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_287/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_287/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_288/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_288/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_289/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_289/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_290/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_290/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_291/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_291/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_292/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_292/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_293/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_293/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_294/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_294/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_295/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_295/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_296/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_296/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_297/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_297/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_298/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_298/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_299/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_299/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_300/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_300/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_301/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_301/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_30/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_30/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_31/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_transpose_31/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_32/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_32/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_33/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_33/bias", "shape": [64], "dtype": "float32"}]}]}