{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_16", "layers": [{"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "conv2d_101", "class_name": "Conv2D", "config": {"name": "conv2d_101", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "leaky_re_lu_91", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_91", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_101", 0, 0, {}]]]}, {"name": "conv2d_102", "class_name": "Conv2D", "config": {"name": "conv2d_102", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_91", 0, 0, {}]]]}, {"name": "leaky_re_lu_92", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_92", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_102", 0, 0, {}]]]}, {"name": "conv2d_103", "class_name": "Conv2D", "config": {"name": "conv2d_103", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_92", 0, 0, {}]]]}, {"name": "leaky_re_lu_93", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_93", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_103", 0, 0, {}]]]}, {"name": "conv2d_104", "class_name": "Conv2D", "config": {"name": "conv2d_104", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_93", 0, 0, {}]]]}, {"name": "leaky_re_lu_94", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_94", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_104", 0, 0, {}]]]}, {"name": "conv2d_105", "class_name": "Conv2D", "config": {"name": "conv2d_105", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_94", 0, 0, {}]]]}, {"name": "leaky_re_lu_95", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_95", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_105", 0, 0, {}]]]}, {"name": "conv2d_106", "class_name": "Conv2D", "config": {"name": "conv2d_106", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_95", 0, 0, {}]]]}, {"name": "leaky_re_lu_96", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_96", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_106", 0, 0, {}]]]}, {"name": "conv2d_transpose_6", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_6", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_96", 0, 0, {}]]]}, {"name": "cropping2d_16", "class_name": "Cropping2D", "config": {"name": "cropping2d_16", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {}]]]}], "input_layers": [["input_16", 0, 0]], "output_layers": [["cropping2d_16", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_101/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_101/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_102/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_102/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_103/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_103/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_104/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_104/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_105/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_105/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_106/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_106/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_6/kernel", "shape": [4, 4, 3, 256], "dtype": "float32"}, {"name": "conv2d_transpose_6/bias", "shape": [3], "dtype": "float32"}]}]}