{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_29", "layers": [{"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "conv2d_302", "class_name": "Conv2D", "config": {"name": "conv2d_302", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"name": "leaky_re_lu_253", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_253", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_302", 0, 0, {}]]]}, {"name": "conv2d_303", "class_name": "Conv2D", "config": {"name": "conv2d_303", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_253", 0, 0, {}]]]}, {"name": "leaky_re_lu_254", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_254", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_303", 0, 0, {}]]]}, {"name": "conv2d_304", "class_name": "Conv2D", "config": {"name": "conv2d_304", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_254", 0, 0, {}]]]}, {"name": "leaky_re_lu_255", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_255", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_304", 0, 0, {}]]]}, {"name": "conv2d_305", "class_name": "Conv2D", "config": {"name": "conv2d_305", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_255", 0, 0, {}]]]}, {"name": "leaky_re_lu_256", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_256", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_305", 0, 0, {}]]]}, {"name": "conv2d_306", "class_name": "Conv2D", "config": {"name": "conv2d_306", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_256", 0, 0, {}]]]}, {"name": "leaky_re_lu_257", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_257", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_306", 0, 0, {}]]]}, {"name": "average_pooling2d_25", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_25", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_257", 0, 0, {}]]]}, {"name": "conv2d_307", "class_name": "Conv2D", "config": {"name": "conv2d_307", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_25", 0, 0, {}]]]}, {"name": "conv2d_308", "class_name": "Conv2D", "config": {"name": "conv2d_308", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_307", 0, 0, {}]]]}, {"name": "multiply_25", "class_name": "Multiply", "config": {"name": "multiply_25", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_257", 0, 0, {}], ["conv2d_308", 0, 0, {}]]]}, {"name": "conv2d_transpose_34", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_34", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_25", 0, 0, {}]]]}, {"name": "leaky_re_lu_258", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_258", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_34", 0, 0, {}]]]}, {"name": "cropping2d_50", "class_name": "Cropping2D", "config": {"name": "cropping2d_50", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_254", 0, 0, {}]]]}, {"name": "add_25", "class_name": "Add", "config": {"name": "add_25", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_258", 0, 0, {}], ["cropping2d_50", 0, 0, {}]]]}, {"name": "conv2d_309", "class_name": "Conv2D", "config": {"name": "conv2d_309", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"name": "leaky_re_lu_259", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_259", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_309", 0, 0, {}]]]}, {"name": "conv2d_310", "class_name": "Conv2D", "config": {"name": "conv2d_310", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_259", 0, 0, {}]]]}, {"name": "conv2d_311", "class_name": "Conv2D", "config": {"name": "conv2d_311", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_310", 0, 0, {}]]]}, {"name": "leaky_re_lu_260", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_260", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_311", 0, 0, {}]]]}, {"name": "conv2d_312", "class_name": "Conv2D", "config": {"name": "conv2d_312", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_260", 0, 0, {}]]]}, {"name": "leaky_re_lu_261", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_261", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_312", 0, 0, {}]]]}, {"name": "conv2d_313", "class_name": "Conv2D", "config": {"name": "conv2d_313", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_261", 0, 0, {}]]]}, {"name": "leaky_re_lu_262", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_262", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_313", 0, 0, {}]]]}, {"name": "conv2d_314", "class_name": "Conv2D", "config": {"name": "conv2d_314", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_262", 0, 0, {}]]]}, {"name": "leaky_re_lu_263", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_263", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_314", 0, 0, {}]]]}, {"name": "conv2d_315", "class_name": "Conv2D", "config": {"name": "conv2d_315", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_263", 0, 0, {}]]]}, {"name": "leaky_re_lu_264", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_264", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_315", 0, 0, {}]]]}, {"name": "average_pooling2d_26", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_26", "trainable": true, "dtype": "float32", "pool_size": [50, 50], "padding": "valid", "strides": [50, 50], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_264", 0, 0, {}]]]}, {"name": "conv2d_316", "class_name": "Conv2D", "config": {"name": "conv2d_316", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_26", 0, 0, {}]]]}, {"name": "conv2d_317", "class_name": "Conv2D", "config": {"name": "conv2d_317", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_316", 0, 0, {}]]]}, {"name": "multiply_26", "class_name": "Multiply", "config": {"name": "multiply_26", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_264", 0, 0, {}], ["conv2d_317", 0, 0, {}]]]}, {"name": "conv2d_318", "class_name": "Conv2D", "config": {"name": "conv2d_318", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_26", 0, 0, {}]]]}, {"name": "leaky_re_lu_265", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_265", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_318", 0, 0, {}]]]}, {"name": "conv2d_319", "class_name": "Conv2D", "config": {"name": "conv2d_319", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_265", 0, 0, {}]]]}, {"name": "leaky_re_lu_266", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_266", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_319", 0, 0, {}]]]}, {"name": "conv2d_320", "class_name": "Conv2D", "config": {"name": "conv2d_320", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_266", 0, 0, {}]]]}, {"name": "leaky_re_lu_267", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_267", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_320", 0, 0, {}]]]}, {"name": "average_pooling2d_27", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_27", "trainable": true, "dtype": "float32", "pool_size": [21, 21], "padding": "valid", "strides": [21, 21], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_267", 0, 0, {}]]]}, {"name": "conv2d_321", "class_name": "Conv2D", "config": {"name": "conv2d_321", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_27", 0, 0, {}]]]}, {"name": "conv2d_322", "class_name": "Conv2D", "config": {"name": "conv2d_322", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_321", 0, 0, {}]]]}, {"name": "multiply_27", "class_name": "Multiply", "config": {"name": "multiply_27", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_267", 0, 0, {}], ["conv2d_322", 0, 0, {}]]]}, {"name": "conv2d_transpose_35", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_35", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_27", 0, 0, {}]]]}, {"name": "leaky_re_lu_268", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_268", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_35", 0, 0, {}]]]}, {"name": "cropping2d_53", "class_name": "Cropping2D", "config": {"name": "cropping2d_53", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_26", 0, 0, {}]]]}, {"name": "add_26", "class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_268", 0, 0, {}], ["cropping2d_53", 0, 0, {}]]]}, {"name": "conv2d_323", "class_name": "Conv2D", "config": {"name": "conv2d_323", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"name": "leaky_re_lu_269", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_269", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_323", 0, 0, {}]]]}, {"name": "conv2d_324", "class_name": "Conv2D", "config": {"name": "conv2d_324", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_269", 0, 0, {}]]]}, {"name": "leaky_re_lu_270", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_270", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_324", 0, 0, {}]]]}, {"name": "average_pooling2d_28", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_28", "trainable": true, "dtype": "float32", "pool_size": [38, 38], "padding": "valid", "strides": [38, 38], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_270", 0, 0, {}]]]}, {"name": "conv2d_325", "class_name": "Conv2D", "config": {"name": "conv2d_325", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_28", 0, 0, {}]]]}, {"name": "conv2d_326", "class_name": "Conv2D", "config": {"name": "conv2d_326", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_325", 0, 0, {}]]]}, {"name": "multiply_28", "class_name": "Multiply", "config": {"name": "multiply_28", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_270", 0, 0, {}], ["conv2d_326", 0, 0, {}]]]}, {"name": "conv2d_transpose_36", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_36", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_28", 0, 0, {}]]]}, {"name": "leaky_re_lu_271", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_271", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_36", 0, 0, {}]]]}, {"name": "cropping2d_52", "class_name": "Cropping2D", "config": {"name": "cropping2d_52", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_261", 0, 0, {}]]]}, {"name": "add_27", "class_name": "Add", "config": {"name": "add_27", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_271", 0, 0, {}], ["cropping2d_52", 0, 0, {}]]]}, {"name": "conv2d_327", "class_name": "Conv2D", "config": {"name": "conv2d_327", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"name": "leaky_re_lu_272", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_272", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_327", 0, 0, {}]]]}, {"name": "conv2d_328", "class_name": "Conv2D", "config": {"name": "conv2d_328", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_272", 0, 0, {}]]]}, {"name": "cropping2d_51", "class_name": "Cropping2D", "config": {"name": "cropping2d_51", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_310", 0, 0, {}]]]}, {"name": "add_28", "class_name": "Add", "config": {"name": "add_28", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_328", 0, 0, {}], ["cropping2d_51", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0]], "output_layers": [["add_28", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_302/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_302/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_303/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_303/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_304/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_304/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_305/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_305/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_306/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_306/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_307/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_307/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_308/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_308/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_309/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_309/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_310/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_310/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_311/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_311/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_312/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_312/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_313/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_313/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_314/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_314/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_315/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_315/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_316/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_316/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_317/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_317/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_318/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_318/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_319/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_319/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_320/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_320/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_321/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_321/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_322/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_322/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_323/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_323/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_324/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_324/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_325/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_325/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_326/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_326/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_327/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_327/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_328/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_328/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_34/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_34/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_35/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_35/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_36/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_36/bias", "shape": [64], "dtype": "float32"}]}]}