{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "conv2d_89", "class_name": "Conv2D", "config": {"name": "conv2d_89", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"name": "leaky_re_lu_79", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_79", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_89", 0, 0, {}]]]}, {"name": "conv2d_90", "class_name": "Conv2D", "config": {"name": "conv2d_90", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_79", 0, 0, {}]]]}, {"name": "leaky_re_lu_80", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_80", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_90", 0, 0, {}]]]}, {"name": "conv2d_91", "class_name": "Conv2D", "config": {"name": "conv2d_91", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_80", 0, 0, {}]]]}, {"name": "leaky_re_lu_81", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_81", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_91", 0, 0, {}]]]}, {"name": "conv2d_92", "class_name": "Conv2D", "config": {"name": "conv2d_92", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_81", 0, 0, {}]]]}, {"name": "leaky_re_lu_82", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_82", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_92", 0, 0, {}]]]}, {"name": "conv2d_93", "class_name": "Conv2D", "config": {"name": "conv2d_93", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_82", 0, 0, {}]]]}, {"name": "leaky_re_lu_83", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_83", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_93", 0, 0, {}]]]}, {"name": "conv2d_94", "class_name": "Conv2D", "config": {"name": "conv2d_94", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_83", 0, 0, {}]]]}, {"name": "leaky_re_lu_84", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_84", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_94", 0, 0, {}]]]}, {"name": "conv2d_transpose_4", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_84", 0, 0, {}]]]}, {"name": "cropping2d_14", "class_name": "Cropping2D", "config": {"name": "cropping2d_14", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}]]]}], "input_layers": [["input_14", 0, 0]], "output_layers": [["cropping2d_14", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_89/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_89/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_90/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_90/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_91/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_91/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_92/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_92/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_93/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_94/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_94/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_4/kernel", "shape": [4, 4, 3, 256], "dtype": "float32"}, {"name": "conv2d_transpose_4/bias", "shape": [3], "dtype": "float32"}]}]}