{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "input_23", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_23"}, "inbound_nodes": []}, {"name": "conv2d_143", "class_name": "Conv2D", "config": {"name": "conv2d_143", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"name": "leaky_re_lu_133", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_133", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_143", 0, 0, {}]]]}, {"name": "conv2d_144", "class_name": "Conv2D", "config": {"name": "conv2d_144", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_133", 0, 0, {}]]]}, {"name": "leaky_re_lu_134", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_134", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_144", 0, 0, {}]]]}, {"name": "conv2d_145", "class_name": "Conv2D", "config": {"name": "conv2d_145", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_134", 0, 0, {}]]]}, {"name": "leaky_re_lu_135", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_135", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_145", 0, 0, {}]]]}, {"name": "conv2d_146", "class_name": "Conv2D", "config": {"name": "conv2d_146", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_135", 0, 0, {}]]]}, {"name": "leaky_re_lu_136", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_136", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_146", 0, 0, {}]]]}, {"name": "conv2d_147", "class_name": "Conv2D", "config": {"name": "conv2d_147", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_136", 0, 0, {}]]]}, {"name": "leaky_re_lu_137", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_137", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_147", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [58, 58], "padding": "valid", "strides": [58, 58], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_137", 0, 0, {}]]]}, {"name": "conv2d_148", "class_name": "Conv2D", "config": {"name": "conv2d_148", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_149", "class_name": "Conv2D", "config": {"name": "conv2d_149", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_148", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_137", 0, 0, {}], ["conv2d_149", 0, 0, {}]]]}, {"name": "conv2d_transpose_13", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_13", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_138", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_138", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_13", 0, 0, {}]]]}, {"name": "cropping2d_23", "class_name": "Cropping2D", "config": {"name": "cropping2d_23", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_134", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_138", 0, 0, {}], ["cropping2d_23", 0, 0, {}]]]}, {"name": "conv2d_150", "class_name": "Conv2D", "config": {"name": "conv2d_150", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_139", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_139", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_150", 0, 0, {}]]]}, {"name": "conv2d_151", "class_name": "Conv2D", "config": {"name": "conv2d_151", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_139", 0, 0, {}]]]}, {"name": "conv2d_152", "class_name": "Conv2D", "config": {"name": "conv2d_152", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_151", 0, 0, {}]]]}, {"name": "leaky_re_lu_140", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_140", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_152", 0, 0, {}]]]}, {"name": "conv2d_153", "class_name": "Conv2D", "config": {"name": "conv2d_153", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_140", 0, 0, {}]]]}, {"name": "leaky_re_lu_141", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_141", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_153", 0, 0, {}]]]}, {"name": "conv2d_154", "class_name": "Conv2D", "config": {"name": "conv2d_154", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_141", 0, 0, {}]]]}, {"name": "leaky_re_lu_142", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_142", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_154", 0, 0, {}]]]}, {"name": "conv2d_155", "class_name": "Conv2D", "config": {"name": "conv2d_155", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_142", 0, 0, {}]]]}, {"name": "leaky_re_lu_143", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_143", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_155", 0, 0, {}]]]}, {"name": "conv2d_156", "class_name": "Conv2D", "config": {"name": "conv2d_156", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_143", 0, 0, {}]]]}, {"name": "leaky_re_lu_144", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_144", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_156", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [50, 50], "padding": "valid", "strides": [50, 50], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_144", 0, 0, {}]]]}, {"name": "conv2d_157", "class_name": "Conv2D", "config": {"name": "conv2d_157", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_158", "class_name": "Conv2D", "config": {"name": "conv2d_158", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_157", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_144", 0, 0, {}], ["conv2d_158", 0, 0, {}]]]}, {"name": "conv2d_159", "class_name": "Conv2D", "config": {"name": "conv2d_159", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_145", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_145", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_159", 0, 0, {}]]]}, {"name": "conv2d_160", "class_name": "Conv2D", "config": {"name": "conv2d_160", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_145", 0, 0, {}]]]}, {"name": "leaky_re_lu_146", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_146", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_160", 0, 0, {}]]]}, {"name": "conv2d_161", "class_name": "Conv2D", "config": {"name": "conv2d_161", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_146", 0, 0, {}]]]}, {"name": "leaky_re_lu_147", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_147", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_161", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [21, 21], "padding": "valid", "strides": [21, 21], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_147", 0, 0, {}]]]}, {"name": "conv2d_162", "class_name": "Conv2D", "config": {"name": "conv2d_162", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_163", "class_name": "Conv2D", "config": {"name": "conv2d_163", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_162", 0, 0, {}]]]}, {"name": "multiply_3", "class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_147", 0, 0, {}], ["conv2d_163", 0, 0, {}]]]}, {"name": "conv2d_transpose_14", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_14", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_148", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_148", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_14", 0, 0, {}]]]}, {"name": "cropping2d_26", "class_name": "Cropping2D", "config": {"name": "cropping2d_26", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 4]], "data_format": "channels_last"}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_148", 0, 0, {}], ["cropping2d_26", 0, 0, {}]]]}, {"name": "conv2d_164", "class_name": "Conv2D", "config": {"name": "conv2d_164", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_149", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_149", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_164", 0, 0, {}]]]}, {"name": "conv2d_165", "class_name": "Conv2D", "config": {"name": "conv2d_165", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_149", 0, 0, {}]]]}, {"name": "leaky_re_lu_150", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_150", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_165", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [38, 38], "padding": "valid", "strides": [38, 38], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_150", 0, 0, {}]]]}, {"name": "conv2d_166", "class_name": "Conv2D", "config": {"name": "conv2d_166", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]]}, {"name": "conv2d_167", "class_name": "Conv2D", "config": {"name": "conv2d_167", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_166", 0, 0, {}]]]}, {"name": "multiply_4", "class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_150", 0, 0, {}], ["conv2d_167", 0, 0, {}]]]}, {"name": "conv2d_transpose_15", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_15", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["multiply_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_151", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_151", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_transpose_15", 0, 0, {}]]]}, {"name": "cropping2d_25", "class_name": "Cropping2D", "config": {"name": "cropping2d_25", "trainable": true, "dtype": "float32", "cropping": [[16, 16], [16, 16]], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_141", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_151", 0, 0, {}], ["cropping2d_25", 0, 0, {}]]]}, {"name": "conv2d_168", "class_name": "Conv2D", "config": {"name": "conv2d_168", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_152", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_152", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_168", 0, 0, {}]]]}, {"name": "conv2d_169", "class_name": "Conv2D", "config": {"name": "conv2d_169", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_152", 0, 0, {}]]]}, {"name": "cropping2d_24", "class_name": "Cropping2D", "config": {"name": "cropping2d_24", "trainable": true, "dtype": "float32", "cropping": [[20, 20], [20, 20]], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_151", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_169", 0, 0, {}], ["cropping2d_24", 0, 0, {}]]]}], "input_layers": [["input_23", 0, 0]], "output_layers": [["add_4", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_143/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_143/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_144/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_144/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_145/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_145/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_146/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_146/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_147/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_147/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_148/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_148/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_149/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_149/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_150/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_150/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_151/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_151/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_152/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_152/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_153/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_153/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_154/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_154/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_155/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_155/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_156/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_156/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_157/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_157/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_158/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_158/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_159/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_159/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_160/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_160/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_161/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_161/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_162/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv2d_162/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_163/kernel", "shape": [1, 1, 16, 128], "dtype": "float32"}, {"name": "conv2d_163/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_164/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_164/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_165/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_165/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_166/kernel", "shape": [1, 1, 64, 8], "dtype": "float32"}, {"name": "conv2d_166/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_167/kernel", "shape": [1, 1, 8, 64], "dtype": "float32"}, {"name": "conv2d_167/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_168/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_168/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_169/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"}, {"name": "conv2d_169/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_13/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_13/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_14/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_14/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_15/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_15/bias", "shape": [64], "dtype": "float32"}]}]}